pillo79/ArduinoCore-zephyr/variants/arduino_portenta_c33_r7fa6m5bh3cfc/llext-edk/include/modules/hal/renesas/drivers/ra/fsp/src/r_sce/crypto_procedures/src/sce7/plainkey/private/inc/hw_sce_ra_private.h
void HW_SCE_SelfCheck1SubSub(void);
void HW_SCE_SelfCheck2SubSub(void);

void HW_SCE_p_func000(uint32_t *InData_PaddedMsg, int32_t MAX_CNT);
void HW_SCE_p_func001(void);
void HW_SCE_p_func002(void);
void HW_SCE_p_func003_r1(uint32_t* ARG1);
void HW_SCE_p_func004_r1(uint32_t ARG1);
void HW_SCE_p_func005_r1(uint32_t ARG1);
void HW_SCE_p_func006(void);
void HW_SCE_p_func007(void);
void HW_SCE_p_func008(void);
void HW_SCE_p_func009(void);
void HW_SCE_p_func010_r1(uint32_t ARG1);
void HW_SCE_p_func011(uint32_t* ARG1);
void HW_SCE_p_func022_r1(void);
void HW_SCE_p_func023_r1(void);
void HW_SCE_p_func025_r1(uint32_t ARG1);
void HW_SCE_p_func027_r1(uint32_t ARG1);
void HW_SCE_p_func028_r1(uint32_t ARG1);
void HW_SCE_p_func043(void);
void HW_SCE_p_func044(void);
void HW_SCE_p_func048(uint32_t* ARG1);
void HW_SCE_p_func049(uint32_t* ARG1);
void HW_SCE_p_func050(uint32_t ARG1);
void HW_SCE_p_func051(void);
void HW_SCE_p_func052(uint32_t ARG1);
void HW_SCE_p_func053(uint32_t ARG1);
void HW_SCE_p_func054(uint32_t ARG1, uint32_t ARG2);
void HW_SCE_p_func057_r1(uint32_t* ARG1, uint32_t* ARG2, uint32_t* ARG3);
void HW_SCE_p_func058(uint32_t* ARG1, uint32_t ARG2);
void HW_SCE_p_func059(void);
void HW_SCE_p_func060(void);
void HW_SCE_p_func061(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func062(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func063(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func064(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func065_r1(uint32_t* ARG1, uint32_t* ARG2);
void HW_SCE_p_func066(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func067(uint32_t ARG1, uint32_t* ARG2);
void HW_SCE_p_func068(void);
void HW_SCE_p_func070(uint32_t ARG1);
void HW_SCE_p_func071(uint32_t ARG1);
void HW_SCE_p_func073(uint32_t ARG1);
void HW_SCE_p_func074_r1(void);
void HW_SCE_p_func075_r1(void);
void HW_SCE_p_func076(void);
void HW_SCE_p_func077(void);
void HW_SCE_p_func080(void);
void HW_SCE_p_func081(void);
void HW_SCE_p_func100(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void HW_SCE_p_func101(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void HW_SCE_p_func102(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void HW_SCE_p_func103(void);
void HW_SCE_p_func200(void);
void HW_SCE_p_func202(void);
void HW_SCE_p_func205(void);
void HW_SCE_p_func206(void);
void HW_SCE_p_func207(void);
void HW_SCE_p_func300(void);
void HW_SCE_p_func301(void);
void HW_SCE_p_func302(void);
void HW_SCE_p_func304(void);
void HW_SCE_p_func307(void);
void HW_SCE_p_func308(void);
void HW_SCE_p_func309(void);
void HW_SCE_p_func310(void);
void HW_SCE_p_func311(void);
void HW_SCE_p_func312(uint32_t ARG1);
void HW_SCE_p_func313(uint32_t ARG1);
void HW_SCE_p_func314(uint32_t ARG1);
void HW_SCE_p_func315(uint32_t ARG1);
void HW_SCE_p_func316(void);
void HW_SCE_p_func317(void);
void HW_SCE_p_func318(void);
void HW_SCE_p_func319(uint32_t ARG1);
void HW_SCE_p_func320(uint32_t ARG1);
void HW_SCE_p_func321(uint32_t ARG1);
void HW_SCE_p_func322(uint32_t ARG1);
void HW_SCE_p_func323(void);
void HW_SCE_p_func324(void);
void HW_SCE_p_func325(void);

void firm_mac_read(uint32_t *InData_Program);

uint32_t change_endian_long(uint32_t data);

fsp_err_t HW_SCE_Aes128CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
fsp_err_t HW_SCE_Aes192CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
fsp_err_t HW_SCE_Aes256CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
void HW_SCE_Aes128CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
void HW_SCE_Aes192CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
void HW_SCE_Aes256CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes192CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes256CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
#endif /* HW_SCE_RA_PRIVATE_HEADER_FILE */
